---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\LukasGrahl\Documents\GIT\econometrics22\log\layoff_discr_3_
> prepro.log
  log type:  text
 opened on:  28 Dec 2022, 20:32:48

. 
. * load data
. use "data\layoff_discr\cps_main_filter.dta", clear

. 
. 
. * analyse unemployement by race
. replace is_layoff=0 if is_layoff==.
(76,642 real changes made)

. bysort race: tab is_layoff

---------------------------------------------------------------------------------
-> race = White Only

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,892       92.15       92.15
          1 |      5,359        7.85      100.00
------------+-----------------------------------
      Total |     68,251      100.00

---------------------------------------------------------------------------------
-> race = Black Only

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,373       89.64       89.64
          1 |        852       10.36      100.00
------------+-----------------------------------
      Total |      8,225      100.00

---------------------------------------------------------------------------------
-> race = American Indian, Alaskan Native Only

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        762       86.49       86.49
          1 |        119       13.51      100.00
------------+-----------------------------------
      Total |        881      100.00

---------------------------------------------------------------------------------
-> race = Asian Only

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,126       90.52       90.52
          1 |        432        9.48      100.00
------------+-----------------------------------
      Total |      4,558      100.00

---------------------------------------------------------------------------------
-> race = Hawaiian/Pacific Islander Only

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        297       91.67       91.67
          1 |         27        8.33      100.00
------------+-----------------------------------
      Total |        324      100.00

---------------------------------------------------------------------------------
-> race = White-Black

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        318       83.91       83.91
          1 |         61       16.09      100.00
------------+-----------------------------------
      Total |        379      100.00

---------------------------------------------------------------------------------
-> race = White-AI

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        369       91.34       91.34
          1 |         35        8.66      100.00
------------+-----------------------------------
      Total |        404      100.00

---------------------------------------------------------------------------------
-> race = White-Asian

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        252       87.20       87.20
          1 |         37       12.80      100.00
------------+-----------------------------------
      Total |        289      100.00

---------------------------------------------------------------------------------
-> race = White-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         65       94.20       94.20
          1 |          4        5.80      100.00
------------+-----------------------------------
      Total |         69      100.00

---------------------------------------------------------------------------------
-> race = Black-AI

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50       79.37       79.37
          1 |         13       20.63      100.00
------------+-----------------------------------
      Total |         63      100.00

---------------------------------------------------------------------------------
-> race = Black-Asian

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22       91.67       91.67
          1 |          2        8.33      100.00
------------+-----------------------------------
      Total |         24      100.00

---------------------------------------------------------------------------------
-> race = Black-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5      100.00      100.00
------------+-----------------------------------
      Total |          5      100.00

---------------------------------------------------------------------------------
-> race = AI-Asian

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3      100.00      100.00
------------+-----------------------------------
      Total |          3      100.00

---------------------------------------------------------------------------------
-> race = AI-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

---------------------------------------------------------------------------------
-> race = Asian-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       93.94       93.94
          1 |          2        6.06      100.00
------------+-----------------------------------
      Total |         33      100.00

---------------------------------------------------------------------------------
-> race = W-B-AI

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22      100.00      100.00
------------+-----------------------------------
      Total |         22      100.00

---------------------------------------------------------------------------------
-> race = W-B-A

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7      100.00      100.00
------------+-----------------------------------
      Total |          7      100.00

---------------------------------------------------------------------------------
-> race = W-B-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

---------------------------------------------------------------------------------
-> race = W-AI-A

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3      100.00      100.00
------------+-----------------------------------
      Total |          3      100.00

---------------------------------------------------------------------------------
-> race = W-AI-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2      100.00      100.00
------------+-----------------------------------
      Total |          2      100.00

---------------------------------------------------------------------------------
-> race = W-A-HP

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         32       91.43       91.43
          1 |          3        8.57      100.00
------------+-----------------------------------
      Total |         35      100.00

---------------------------------------------------------------------------------
-> race = W-B-AI-A

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

---------------------------------------------------------------------------------
-> race = Other 3 Race Combinations

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3      100.00      100.00
------------+-----------------------------------
      Total |          3      100.00

---------------------------------------------------------------------------------
-> race = Other 4 and 5 Race Combinations

  is_layoff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5      100.00      100.00
------------+-----------------------------------
      Total |          5      100.00


. tab race

                                race |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                          White Only |     68,251       81.65       81.65
                          Black Only |      8,225        9.84       91.49
American Indian, Alaskan Native Only |        881        1.05       92.55
                          Asian Only |      4,558        5.45       98.00
      Hawaiian/Pacific Islander Only |        324        0.39       98.39
                         White-Black |        379        0.45       98.84
                            White-AI |        404        0.48       99.32
                         White-Asian |        289        0.35       99.67
                            White-HP |         69        0.08       99.75
                            Black-AI |         63        0.08       99.83
                         Black-Asian |         24        0.03       99.86
                            Black-HP |          5        0.01       99.86
                            AI-Asian |          3        0.00       99.86
                               AI-HP |          1        0.00       99.87
                            Asian-HP |         33        0.04       99.91
                              W-B-AI |         22        0.03       99.93
                               W-B-A |          7        0.01       99.94
                              W-B-HP |          1        0.00       99.94
                              W-AI-A |          3        0.00       99.94
                             W-AI-HP |          2        0.00       99.95
                              W-A-HP |         35        0.04       99.99
                            W-B-AI-A |          1        0.00       99.99
           Other 3 Race Combinations |          3        0.00       99.99
     Other 4 and 5 Race Combinations |          5        0.01      100.00
-------------------------------------+-----------------------------------
                               Total |     83,588      100.00

. save "data\layoff_discr\cps_main_prepro.dta", replace
file data\layoff_discr\cps_main_prepro.dta saved

. 
. /*##########################
> Tele work index by naic
> ############################*/
. 
. * load and rename telework index data
. import delimited "data\layoff_discr\raw\naic_telework_index_map", clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 263 obs)

. 
. tostring naic_id, gen(_naic)
_naic generated as str3

. replace _naic=substr(_naic ,1,1)+substr(_naic ,1,1)
(263 real changes made)

. destring _naic, gen(naic_2dig)
_naic: all characters numeric; naic_2dig generated as byte

. drop _naic

. 
. rename census_id job_ind_naics

. rename description naic_description

. sort job_ind_naics

. 
. save "data\layoff_discr\naic_tel.dta", replace
file data\layoff_discr\naic_tel.dta saved

. 
. use "data\layoff_discr\cps_main_prepro.dta", clear

. sort job_ind_naics

. merge m:1 job_ind_naics using "data\layoff_discr\naic_tel.dta", generate(gh)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            70
        from master                        70  (gh==1)
        from using                          0  (gh==2)

    Matched                            83,518  (gh==3)
    -----------------------------------------

. replace job_ind_naics=. if job_ind_naics==-1
(70 real changes made, 70 to missing)

. 
. * dropping 77 missing naics
. drop if job_ind_naics==.
(70 observations deleted)

. save "data\layoff_discr\cps_main_prepro.dta", replace
file data\layoff_discr\cps_main_prepro.dta saved

. 
. /*##########################
> Covid data by state
> ############################*/
. 
. *get pop data
. import delimited "data\layoff_discr\raw\usa_population.csv", varnames(1) groups
> eparator(,) clear
(encoding automatically selected: ISO-8859-1)
(3 vars, 51 obs)

. rename state_abrv us_state_str

. drop state

. sort us_state_str

. save "data\layoff_discr\raw\usa_population_edit.dta", replace
file data\layoff_discr\raw\usa_population_edit.dta saved

. 
. *get covid data
. import delimited "data\layoff_discr\raw\usa_covid_cases_out.csv", clear
(encoding automatically selected: ISO-8859-1)
(19 vars, 60,060 obs)

. gen hrmonth=month

. rename state us_state_str

. keep if year==2020
(39,360 observations deleted)

. keep if month==3 | month==4 | month==5 //| month==6 //| month==7
(15,180 observations deleted)

. 
. *merge population data
. sort us_state_str

. merge m:1 us_state_str using "data\layoff_discr\raw\usa_population_edit", gener
> ate(ght)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           828
        from master                       828  (ght==1)
        from using                          0  (ght==2)

    Matched                             4,692  (ght==3)
    -----------------------------------------

. 
. * get covid per 100.000 inhabitants
. gen tot_casesp=tot_cases/(population/100000)
(828 missing values generated)

. gen new_casesp=new_case/(population/100000)
(828 missing values generated)

. gen tot_deathp=tot_death/(population/100000)
(828 missing values generated)

. gen new_deathp=tot_death/(population/100000)
(828 missing values generated)

. 
. * get monthly averages
. global XPop "tot_casesp new_casesp tot_deathp new_deathp"

. foreach var in $XPop{
  2.         by us_state_str hrmonth, sort: egen `var'm = mean(`var')
  3.         }
(828 missing values generated)
(828 missing values generated)
(828 missing values generated)
(828 missing values generated)

. keep if day==1
(5,340 observations deleted)

. 
. sort us_state_str hrmonth

. save "data\layoff_discr\usa_covid.dta", replace
file data\layoff_discr\usa_covid.dta saved

. 
. *merge covid to main data
. use "data\layoff_discr\cps_main_prepro.dta", clear

. decode us_state, gen(us_state_str)

. 
. sort us_state_str hrmonth

. merge m:1 us_state_str hrmonth using "data\layoff_discr\usa_covid"
(variable us_state_str was str2, now str3 to accommodate using data's values)
(variable hrmonth was byte, now float to accommodate using data's values)
(label _merge already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            27
        from master                         0  (_merge==1)
        from using                         27  (_merge==2)

    Matched                            83,518  (_merge==3)
    -----------------------------------------

. 
. 
. /*##############################
> edit varialbles
> ################################*/
. 
. * age squared
. gen age2=age^2
(27 missing values generated)

. 
. * is native
. gen is_native=1 if race==3 | race==5 
(82,342 missing values generated)

. replace is_native=0 if is_native==.
(82,342 real changes made)

. * is poc
. gen is_poc=1 if race==6 | race==2 | race==10
(74,888 missing values generated)

. replace is_poc=0 if is_poc==.
(74,888 real changes made)

. * is asian
. gen is_asian=1 if race==4 | race==8 | race==11
(78,678 missing values generated)

. replace is_asian=0 if is_asian==.
(78,678 real changes made)

. * is hisp
. gen is_hisp=1 if race==9 | race==12 | race==14
(83,470 missing values generated)

. replace is_hisp=0 if is_hisp==.
(83,470 real changes made)

. * is white
. gen is_white=1 if is_native==0 & is_poc==0 & is_asian==0 & is_hisp==0
(14,802 missing values generated)

. replace is_white=0 if is_white==.
(14,802 real changes made)

. 
. gen _race="white"

. replace _race="native" if is_native==1
variable _race was str5 now str6
(1,203 real changes made)

. replace _race="poc" if is_poc==1
(8,657 real changes made)

. replace _race="asian" if is_asian==1
(4,867 real changes made)

. replace _race="hisp" if is_hisp==1
(75 real changes made)

. encode _race, gen(race_cat)

. 
. * assing 0 to nans
. replace is_more1job=2 if is_more1job==-1
(6,876 real changes made)

. label define l_ismore1job 1 "more than 1 job" 2 "1 job only"

. label value is_more1job l_ismore1job

. 
. replace owns_business=2 if owns_business==-1 | owns_business==-2 | owns_busines
> s==-3
(230 real changes made)

. label define l_owns_bussiness 1 "owns business" 2 "does not own business"

. label value owns_business l_owns_bussiness

. 
. replace is_vet=2 if is_vet==-1
(289 real changes made)

. 
. * time state cluster var
. tostring hrmonth, gen(hrmonth_str)
hrmonth_str generated as str1

. gen _monthstate=hrmonth_str+us_state_str

. encode _monthstate, gen(month_state)

. 
. 
. * binary is_uscitiz
. gen is_citiz=.
(83,545 missing values generated)

. replace is_citiz=0 if is_uscitiz!=5
(78,359 real changes made)

. replace is_citiz=1 if is_uscitiz==5
(5,186 real changes made)

. drop is_uscitiz

. 
. * use county code
. replace county_code=. if county_code==0
(49,761 real changes made, 49,761 to missing)

. 
. * get binary gender
. gen is_female=0

. replace is_female=1 if gender==2
(39,077 real changes made)

. 
. * percentage weights
. sum hh_weight

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   hh_weight |     83,518    3.16e+07    1.88e+07    1534265   2.50e+08

. gen hh_weight_perc = hh_weight /r(sum)
(27 missing values generated)

. 
. * all under highschool into one category
. replace level_educ=38 if level_educ<=38
(4,248 real changes made)

. label define l_level_educ 38 "12th grade no diploma" 39 "high school grad-diplo
> ma or equiv (ged)" 40 "some college but no degree" 41 "associate degree-occupat
> ional/vocational" 42 "associate degree-academic program" 43 "bachelor's degree 
> (ex: ba, ab, bs)" 44 "master's degree (ex: ma, ms, meng, med, msw)" 45 "profess
> ional school deg (ex: md, dds, dvm)" 46 "doctorate degree (ex: phd, edd)" 

. label value level_educ l_level_educ

. 
. * label data income
. label define l_hh_income 1 "Income: < 5" 2 "Income: 5 > < 7.5"  3 "Income: 7.5 
> > < 10" 4 "Income: 10 > < 12.5" 5 "Income: 12.5 > < 15" 6 "Income: 15 > < 20" 7
>  "Income: 20 > < 25" 8"Income: 25 > < 30" 9 "Income: 30 > < 35" 10 "Income: 35 
> > < 40" 11 "Income: 40 > < 50" 12 "Income: 50 > < 60" 13 "Income: 60 > < 75" 14
>  "Income: 75 > < 100" 15 "Income: 100 > < 150" 16 "Income: 150 >"

. label value hh_income l_hh_income

. tab hh_income

          hh_income |      Freq.     Percent        Cum.
--------------------+-----------------------------------
        Income: < 5 |        683        0.82        0.82
  Income: 5 > < 7.5 |        429        0.51        1.33
 Income: 7.5 > < 10 |        509        0.61        1.94
Income: 10 > < 12.5 |        901        1.08        3.02
Income: 12.5 > < 15 |        869        1.04        4.06
  Income: 15 > < 20 |      1,699        2.03        6.09
  Income: 20 > < 25 |      2,504        3.00        9.09
  Income: 25 > < 30 |      2,921        3.50       12.59
  Income: 30 > < 35 |      3,675        4.40       16.99
  Income: 35 > < 40 |      3,920        4.69       21.68
  Income: 40 > < 50 |      6,535        7.82       29.51
  Income: 50 > < 60 |      7,335        8.78       38.29
  Income: 60 > < 75 |      9,729       11.65       49.94
 Income: 75 > < 100 |     12,688       15.19       65.13
Income: 100 > < 150 |     14,578       17.45       82.59
      Income: 150 > |     14,543       17.41      100.00
--------------------+-----------------------------------
              Total |     83,518      100.00

. 
. *month
. label define l_hrmonth 3 "Mar" 4 "Apr" 5 "Mai"

. label value hrmonth l_hrmonth

. tab hrmonth

    hrmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
        Mar |     29,886       35.77       35.77
        Apr |     27,269       32.64       68.41
        Mai |     26,390       31.59      100.00
------------+-----------------------------------
      Total |     83,545      100.00

. 
. * contract type
. tab contract_type

        contract_type |      Freq.     Percent        Cum.
----------------------+-----------------------------------
FULL TIME LABOR FORCE |     70,382       84.27       84.27
PART TIME LABOR FORCE |     13,136       15.73      100.00
----------------------+-----------------------------------
                Total |     83,518      100.00

. label define l_contract_type 1 "full-time" 2 "part-time"

. label value contract_type l_contract_type

. 
. 
. *housing kind 
. label define l_housing_kind 1 "house, apartment, flat" 2 "hu in nontransient ho
> tel, motel, etc." 3 "hu permanent in transient hotel, motel" 4 "hu in rooming h
> ouse" 5 "mobile home or trailer w/no perm. room added" 6 "mobile home or traile
> r w/1 or more perm. rooms added" 7 "hu not specified above" 10 "unoccupied tent
>  site or trlr site" 12 "other unit not specified above" 

. label value housing_kind l_housing_kind

. 
. * tabulate with values and labels
. preserve

. numlabel `r(names)', add

. tab housing_kind

                           housing_kind |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
              1. house, apartment, flat |     80,294       96.14       96.14
2. hu in nontransient hotel, motel, etc |         19        0.02       96.16
3. hu permanent in transient hotel, mot |          8        0.01       96.17
                 4. hu in rooming house |         26        0.03       96.20
5. mobile home or trailer w/no perm. ro |      2,749        3.29       99.49
6. mobile home or trailer w/1 or more p |        375        0.45       99.94
              7. hu not specified above |         16        0.02       99.96
  10. unoccupied tent site or trlr site |          1        0.00       99.96
     12. other unit not specified above |         30        0.04      100.00
----------------------------------------+-----------------------------------
                                  Total |     83,518      100.00

. restore

. 
. *marista 
. label define l_marista 1 "married - spouse present" 2 "married - spouse absent"
>  3 "widowed" 4 "divorced" 5 "separated" 6 "never married" 

. label value marista l_marista

. 
. *citizen
. label define l_is_citizen 0 "us citizenship" 1 "no us citizenship"

. label value is_citiz l_is_citizen

. 
. save "data\layoff_discr\cps_main_prepro.dta", replace
file data\layoff_discr\cps_main_prepro.dta saved

. 
. 
.   
. 
end of do-file

. do "C:\Users\LukasGrahl\Documents\GIT\econometrics22\src\layoff_discr_4_fe.do"

. *Preamble
. clear mata

. capture log close
