------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\LukasGrahl\Documents\GIT\econometrics22\log\layoff_discr_5_oxabl.log
  log type:  text
 opened on:   1 Dec 2022, 16:23:17

. 
. use "data\layoff_discr\cps_main_prepro.dta", clear

. 
. *tab unemployement by race and month
. tabulate race_cat is_layoff, row nofreq chi2

           |       is_layoff
  race_cat |         0          1 |     Total
-----------+----------------------+----------
     asian |     90.40       9.60 |    100.00 
      hisp |     94.67       5.33 |    100.00 
    native |     88.03      11.97 |    100.00 
       poc |     89.42      10.58 |    100.00 
     white |     92.22       7.78 |    100.00 
-----------+----------------------+----------
     Total |     91.77       8.23 |    100.00 

          Pearson chi2(4) = 116.9967   Pr = 0.000

. 
. 
. /*##########################################
> Oaxaca Blinder Decomposition
> ############################################*/
. gen isn_white=1 if is_white==0
(68,743 missing values generated)

. replace isn_white=0 if isn_white==.
(68,743 real changes made)

. tab isn_white

  isn_white |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,743       82.28       82.28
          1 |     14,802       17.72      100.00
------------+-----------------------------------
      Total |     83,545      100.00

. 
. keep if hrmonth==5
(57,155 observations deleted)

. 
. oaxaca ///
> is_layoff /// dependent
> gender level_educ age age2 hh_income contract_type teleworkable_emp /// independent
> [fweight=hh_weight] /// weights
> ,by(is_poc) logit /// group var: white
> 

Blinder-Oaxaca decomposition                            Number of obs = 26,381
                                                  Model           =      logit
Group 1: is_poc = 0                               N of obs 1      =      23713
Group 2: is_poc = 1                               N of obs 2      =       2668

----------------------------------------------------------------------------------
       is_layoff | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
overall          |
         group_1 |   .1107375   3.61e-07  3.1e+05   0.000     .1107368    .1107382
         group_2 |   .1559444   1.05e-06  1.5e+05   0.000     .1559424    .1559465
      difference |  -.0452069   1.11e-06 -4.1e+04   0.000    -.0452091   -.0452047
      endowments |  -.0289363   5.22e-07 -5.5e+04   0.000    -.0289374   -.0289353
    coefficients |  -.0223075   1.13e-06 -2.0e+04   0.000    -.0223097   -.0223053
     interaction |   .0060369   5.15e-07  1.2e+04   0.000     .0060359    .0060379
-----------------+----------------------------------------------------------------
endowments       |
          gender |  -.0027337   2.24e-07 -1.2e+04   0.000    -.0027342   -.0027333
      level_educ |  -.0053166   2.29e-07 -2.3e+04   0.000     -.005317   -.0053161
             age |  -.0172005   1.02e-06 -1.7e+04   0.000    -.0172025   -.0171985
            age2 |   .0136163   1.05e-06  1.3e+04   0.000     .0136142    .0136184
       hh_income |  -.0171758   4.28e-07 -4.0e+04   0.000    -.0171767    -.017175
   contract_type |  -.0001369   4.83e-08 -2833.13   0.000     -.000137   -.0001368
teleworkable_emp |   .0000109   1.07e-07   101.56   0.000     .0000107    .0000111
-----------------+----------------------------------------------------------------
coefficients     |
          gender |   .0355563   3.30e-06  1.1e+04   0.000     .0355498    .0355628
      level_educ |   .1117472   .0000201  5573.08   0.000     .1117079    .1117865
             age |   .0270479   .0000179  1513.84   0.000     .0270129     .027083
            age2 |   .0089358   9.34e-06   956.59   0.000     .0089175    .0089542
       hh_income |   .0128055   3.54e-06  3621.38   0.000     .0127985    .0128124
   contract_type |   .0841529   4.04e-06  2.1e+04   0.000      .084145    .0841608
teleworkable_emp |  -.0193501   2.60e-06 -7446.31   0.000    -.0193552    -.019345
           _cons |  -.2832031   .0000236 -1.2e+04   0.000    -.2832494   -.2831568
-----------------+----------------------------------------------------------------
interaction      |
          gender |  -.0047565   7.43e-07 -6403.20   0.000    -.0047579    -.004755
      level_educ |   .0025449   4.22e-07  6033.23   0.000     .0025441    .0025457
             age |    .002893   1.93e-06  1497.14   0.000     .0028892    .0028968
            age2 |   .0019033   1.98e-06   960.03   0.000     .0018995    .0019072
       hh_income |    .003008   6.96e-07  4324.18   0.000     .0030066    .0030094
   contract_type |   .0004396   1.52e-07  2898.54   0.000     .0004393    .0004399
teleworkable_emp |   4.51e-06   4.44e-08   101.61   0.000     4.42e-06    4.60e-06
----------------------------------------------------------------------------------

. 
end of do-file

