------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\LukasGrahl\Documents\GIT\2022_econometrics\log\layoff_discr_5_oxabl.log
  log type:  text
 opened on:  28 Nov 2022, 15:31:35

. 
. use "data\layoff_discr\cps_main_prepro.dta", clear

. 
. *tab unemployement by race and month
. tabulate race_cat is_layoff, row nofreq chi2

           |       is_layoff
  race_cat |         0          1 |     Total
-----------+----------------------+----------
     asian |     90.76       9.24 |    100.00 
      hisp |     94.87       5.13 |    100.00 
    native |     87.85      12.15 |    100.00 
       poc |     89.19      10.81 |    100.00 
     white |     92.16       7.84 |    100.00 
-----------+----------------------+----------
     Total |     91.71       8.29 |    100.00 

          Pearson chi2(4) = 120.8199   Pr = 0.000

. 
. 
. /*##########################################
> Oaxaca Blinder Decomposition
> ############################################*/
. gen isn_white=1 if is_white==0
(68,755 missing values generated)

. replace isn_white=0 if isn_white==.
(68,755 real changes made)

. tab isn_white

  isn_white |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,755       82.23       82.23
          1 |     14,861       17.77      100.00
------------+-----------------------------------
      Total |     83,616      100.00

. 
. keep if hrmonth==5
(57,188 observations deleted)

. 
. oaxaca ///
> is_layoff /// dependent
> gender level_educ age age2 hh_income contract_type teleworkable_emp /// independent
> [fweight=hh_weight] /// weights
> ,by(isn_white) logit /// group var: white
> 

Blinder-Oaxaca decomposition                            Number of obs = 26,377
                                                  Model           =      logit
Group 1: isn_white = 0                            N of obs 1      =      21809
Group 2: isn_white = 1                            N of obs 2      =       4568

----------------------------------------------------------------------------------
       is_layoff | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
overall          |
         group_1 |   .1089285   3.76e-07  2.9e+05   0.000     .1089278    .1089293
         group_2 |   .1471607   8.13e-07  1.8e+05   0.000     .1471591    .1471623
      difference |  -.0382322   8.96e-07 -4.3e+04   0.000    -.0382339   -.0382304
      endowments |  -.0122421   3.76e-07 -3.3e+04   0.000    -.0122428   -.0122414
    coefficients |  -.0289399   8.97e-07 -3.2e+04   0.000    -.0289416   -.0289381
     interaction |   .0029498   3.53e-07  8345.63   0.000     .0029491    .0029505
-----------------+----------------------------------------------------------------
endowments       |
          gender |  -.0014828   1.72e-07 -8623.32   0.000    -.0014832   -.0014825
      level_educ |    .001766   1.40e-07  1.3e+04   0.000     .0017658    .0017663
             age |  -.0330685   1.38e-06 -2.4e+04   0.000    -.0330712   -.0330658
            age2 |   .0306549   1.48e-06  2.1e+04   0.000      .030652    .0306578
       hh_income |   -.012854   2.66e-07 -4.8e+04   0.000    -.0128546   -.0128535
   contract_type |  -.0000475   3.49e-08 -1361.18   0.000    -.0000476   -.0000474
teleworkable_emp |   .0027899   1.54e-07  1.8e+04   0.000     .0027896    .0027902
-----------------+----------------------------------------------------------------
coefficients     |
          gender |     .04665   2.92e-06  1.6e+04   0.000     .0466443    .0466558
      level_educ |   .2803556   .0000187  1.5e+04   0.000     .2803189    .2803923
             age |   .1033316   .0000161  6420.94   0.000     .1033001    .1033632
            age2 |  -.0390302   8.21e-06 -4755.24   0.000    -.0390463   -.0390141
       hh_income |   .0245089   3.36e-06  7291.16   0.000     .0245023    .0245155
   contract_type |   .0531371   3.01e-06  1.8e+04   0.000     .0531312     .053143
teleworkable_emp |  -.0241194   2.34e-06 -1.0e+04   0.000     -.024124   -.0241149
           _cons |  -.4737736   .0000226 -2.1e+04   0.000    -.4738178   -.4737293
-----------------+----------------------------------------------------------------
interaction      |
          gender |  -.0062312   1.35e-06 -4631.63   0.000    -.0062338   -.0062286
      level_educ |  -.0016847   3.71e-07 -4543.93   0.000    -.0016855    -.001684
             age |   .0177743   4.50e-06  3952.41   0.000     .0177655    .0177831
            age2 |    -.01399   4.30e-06 -3253.81   0.000    -.0139984   -.0139815
       hh_income |   .0041817   6.65e-07  6288.38   0.000     .0041804     .004183
   contract_type |   .0014188   2.65e-07  5351.83   0.000     .0014183    .0014193
teleworkable_emp |   .0014809   2.92e-07  5072.37   0.000     .0014803    .0014815
----------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
