---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\LukasGrahl\Documents\GIT\econometrics22\log\layoff_discr_5_
> oxabl.log
  log type:  text
 opened on:   5 Dec 2022, 13:58:08

. 
. use "data\layoff_discr\cps_main_prepro.dta", clear

. 
. *tab unemployement by race and month
. tabulate race_cat is_layoff, row nofreq chi2

           |       is_layoff
  race_cat |         0          1 |     Total
-----------+----------------------+----------
     asian |     90.40       9.60 |    100.00 
      hisp |     94.67       5.33 |    100.00 
    native |     88.03      11.97 |    100.00 
       poc |     89.42      10.58 |    100.00 
     white |     92.22       7.78 |    100.00 
-----------+----------------------+----------
     Total |     91.77       8.23 |    100.00 

          Pearson chi2(4) = 116.9967   Pr = 0.000

. 
. 
. /*##########################################
> Oaxaca Blinder Decomposition
> ############################################*/
. gen isn_white=1 if is_white==0
(68,743 missing values generated)

. replace isn_white=0 if isn_white==.
(68,743 real changes made)

. tab isn_white

  isn_white |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,743       82.28       82.28
          1 |     14,802       17.72      100.00
------------+-----------------------------------
      Total |     83,545      100.00

. 
. keep if hrmonth==5
(57,155 observations deleted)

. 
. oaxaca ///
> is_layoff /// dependent
> gender level_educ age age2 hh_income contract_type teleworkable_emp /// indepen
> dent
> [fweight=hh_weight] /// weights
> ,by(is_poc) twofold /// group var: white
> 
option twofold not allowed
r(198);

end of do-file

r(198);

. exit, clear
